import ArticleCardGroupView from "@/components/displays/Carousel/ArticleCardGroupView";
import { ArticleItem } from "@/models/content.model";
import Carousel from "react-material-ui-carousel";

//#region
const articleStep1: ArticleItem[] = [
  {
    contentId: 1,
    altImg: "save Money",
    pathImg: "img/contents/saveMoney.png",
    title: "กฎการออมเงินให้รวย",
    detail: `การมีอิสระภาพทางการนั้นเป็นของผู้ที่มีการควบคุมการเงินของตัวเองได้อย่างดี​ โดยเริ่มจากการออมเงินให้ทุกๆเดือนอย่างน้อย10%ขึ้นไป

  1. จ่ายให้ตัวเองก่อนทุกครั้งที่มีรายได้เข้ามาไม่ว่าช่องทางไหนให้เราแบ่ง10%ไว้จ่ายให้เราก่อนเสมอ​ โดยแยกเก็บไว้ในบัญชีที่แยกไว้ชัดเจนไม่แตะต้องหรือใช้เงินส่วนนี้้​ โดยออมในกองทุนไว้ต่างหากในพวกตราสารหนี้ที่มีความเสี่ยงต่ำ​ก็ได้เพื่อให้มีเงินใช้ในอนาคต​หลังจากทำงานไม่ได้แล้ว และส่วนที่เหลืออีก90%เราก็สามารถใช้ได้เจ็มที่ถึงแม้ว่าก่อนหน้านี้ที่เราใช้100%ก็ยังเหมือนว่าไม่พอใช้แต่จริงๆแล้วคนเราสามารถปรับตัวให้เข้ากับสถานการณ์และทรัพยากร​ที่บีบบังคับได้เป็นอย่างดี​ หลังจากนั้นค่อยทยอยเพิ่มสัดส่วนการเก็บออมขึ้นเรื่อยๆ
   
  2. ให้ใช้ประโยชน์​จากการลดหย่อนภาษีอย่างเต็มที่​ ซึ่งภาษีของคนที่ทำงานเป็นพนักงานทั่วไปจะอยู่ตั้งแต่​ 0-35% คิดตามขั้นบันไดรายได้​ หากเราไม่ใช้การลดหย่อนออม​ ลงทุน​ ใช้จ่ายหรือบริจาคเลยจะทำให้เราเสียเงินเพิ่มอีกจากที่เราต้องจ่ายภาษีในการจับจ่ายใช้สอยทั่วไปอยู่แล้ว​ ดังนั้นการลงทุนแบบออมเช่นกองทุน​ SSF RMF ก็สามารถนำมาลดหย่อนได้​เป็นต้น
  `,
  },
  {
    contentId: 2,
    altImg: "earn Money",
    pathImg: "img/contents/earnMoney.png",
    title: "จงใช้เวลาพุ่งเป้าไปที่การสร้างเงิน​ ไม่ใช่ใช้เวลาการออมเงิน",
    detail: `ต้องใช้เวลาอย่างน้อย95%ในการสร้างเงิน​ และใช้เวลาน้อยกว่า5%ในการออมเงิน
  หลายคนมีทัศนคติและการตั้งคำถามที่แตกต่างกันเรื่องการเงิน​ การที่เราจะหลุดการเป็นหนี้ได้นั้นต้องมีวินัยเรื่องการใช้จ่ายและเก็บออม​ บางคนคิดว่าจะแบ่งเก็บเงินอดออมได้อย่างไรในเมื่อทุกวันนี้เงินที่มีในแต่ละวันก็ไม่พอใช้อยู่แล้ว​ แต่ละเดือนก็ไม่พอใช้แค่เดือนชนเดือนยังยากเลยแล้วจะไปมีเงินเก็บได้อย่างไร​ บางทีคนทีคนที่คิดแบบนี้อาจจะเป็นปัญหาเรื่องการตั้งคำถามในแง่ลบเกินไป​ทำให้ลดทอนกำลังใจ
  แต่ถ้าเป็นเปลี่ยนคำถามใหม่ล่ะว่าปัจจุบันนี้เงินไม่พอใช้และไม่เหลือเก็บ​ แล้วจะทำยังไงให้มีเงินพอใช้และมีเงินเหลือเก็บ​ หากงานในปัจจุบันเงินน้อยไม่พอใช้​ เราสามารถทำงานดสริมอื่นงานที่2งานที่3ช่องทางอื่นๆ วิธีไหนที่สามารถมีรายได้เพิ่มได้หรือไม่ทำเราสามารถทำได้​ ลงทุนน้อยหรือไม่ลงทุนเลย​ สิ่งที่เราชอบหรือสนใจอยู่แล้ว​ ซึ่งมีหลายช่องทางหลายวิธีในปัจจุบันให้เลือกตามความชอบและถนัดของแต่ละคน​ น่าจะเป็นการตั้งคำถามที่เป็นแรงกระตุ้นให้เราคิด​ หาช่องทางและวิธีการต่างๆในการสร้างรายได้เพิ่ม​ หากเราเจอช่องทางในการสร้างรายได้เพิ่มขึ้นมากกว่า1ช่องทาง มีรายได้มากขึ้น ไม่เพิ่มรายจ่ายตาม เคลียหนี้สินที่มีอยู่​ สุดท้ายจึงค่อยแบ่งเงินเก็บออมได้มากตามไปด้วย`,
  },
];
const articleStep2: ArticleItem[] = [
  {
    contentId: 3,
    altImg: "financial advisor",
    pathImg: "img/contents/advisor.png",
    title: "คำแนะนำทางการเงิน",
    detail: ``,
  },
  {
    contentId: 4,
    altImg: "earn Money",
    pathImg: "img/contents/earnMoney.png",
    title: "จงใช้เวลาพุ่งเป้าไปที่การสร้างเงิน​ ไม่ใช่ใช้เวลาการออมเงิน",
    detail: `ต้องใช้เวลาอย่างน้อย95%ในการสร้างเงิน​ และใช้เวลาน้อยกว่า5%ในการออมเงิน
  หลายคนมีทัศนคติและการตั้งคำถามที่แตกต่างกันเรื่องการเงิน​ การที่เราจะหลุดการเป็นหนี้ได้นั้นต้องมีวินัยเรื่องการใช้จ่ายและเก็บออม​ บางคนคิดว่าจะแบ่งเก็บเงินอดออมได้อย่างไรในเมื่อทุกวันนี้เงินที่มีในแต่ละวันก็ไม่พอใช้อยู่แล้ว​ แต่ละเดือนก็ไม่พอใช้แค่เดือนชนเดือนยังยากเลยแล้วจะไปมีเงินเก็บได้อย่างไร​ บางทีคนทีคนที่คิดแบบนี้อาจจะเป็นปัญหาเรื่องการตั้งคำถามในแง่ลบเกินไป​ทำให้ลดทอนกำลังใจ
  แต่ถ้าเป็นเปลี่ยนคำถามใหม่ล่ะว่าปัจจุบันนี้เงินไม่พอใช้และไม่เหลือเก็บ​ แล้วจะทำยังไงให้มีเงินพอใช้และมีเงินเหลือเก็บ​ หากงานในปัจจุบันเงินน้อยไม่พอใช้​ เราสามารถทำงานดสริมอื่นงานที่2งานที่3ช่องทางอื่นๆ วิธีไหนที่สามารถมีรายได้เพิ่มได้หรือไม่ทำเราสามารถทำได้​ ลงทุนน้อยหรือไม่ลงทุนเลย​ สิ่งที่เราชอบหรือสนใจอยู่แล้ว​ ซึ่งมีหลายช่องทางหลายวิธีในปัจจุบันให้เลือกตามความชอบและถนัดของแต่ละคน​ น่าจะเป็นการตั้งคำถามที่เป็นแรงกระตุ้นให้เราคิด​ หาช่องทางและวิธีการต่างๆในการสร้างรายได้เพิ่ม​ หากเราเจอช่องทางในการสร้างรายได้เพิ่มขึ้นมากกว่า1ช่องทาง มีรายได้มากขึ้น ไม่เพิ่มรายจ่ายตาม เคลียหนี้สินที่มีอยู่​ สุดท้ายจึงค่อยแบ่งเงินเก็บออมได้มากตามไปด้วย`,
  },
];
const articleStep3: ArticleItem[] = [
  {
    contentId: 5,
    altImg: "save Money",
    pathImg: "img/contents/saveMoney.png",
    title: "กฎการออมเงินให้รวย",
    detail: `การมีอิสระภาพทางการนั้นเป็นของผู้ที่มีการควบคุมการเงินของตัวเองได้อย่างดี​ โดยเริ่มจากการออมเงินให้ทุกๆเดือนอย่างน้อย10%ขึ้นไป

  1. จ่ายให้ตัวเองก่อนทุกครั้งที่มีรายได้เข้ามาไม่ว่าช่องทางไหนให้เราแบ่ง10%ไว้จ่ายให้เราก่อนเสมอ​ โดยแยกเก็บไว้ในบัญชีที่แยกไว้ชัดเจนไม่แตะต้องหรือใช้เงินส่วนนี้้​ โดยออมในกองทุนไว้ต่างหากในพวกตราสารหนี้ที่มีความเสี่ยงต่ำ​ก็ได้เพื่อให้มีเงินใช้ในอนาคต​หลังจากทำงานไม่ได้แล้ว และส่วนที่เหลืออีก90%เราก็สามารถใช้ได้เจ็มที่ถึงแม้ว่าก่อนหน้านี้ที่เราใช้100%ก็ยังเหมือนว่าไม่พอใช้แต่จริงๆแล้วคนเราสามารถปรับตัวให้เข้ากับสถานการณ์และทรัพยากร​ที่บีบบังคับได้เป็นอย่างดี​ หลังจากนั้นค่อยทยอยเพิ่มสัดส่วนการเก็บออมขึ้นเรื่อยๆ
   
  2. ให้ใช้ประโยชน์​จากการลดหย่อนภาษีอย่างเต็มที่​ ซึ่งภาษีของคนที่ทำงานเป็นพนักงานทั่วไปจะอยู่ตั้งแต่​ 0-35% คิดตามขั้นบันไดรายได้​ หากเราไม่ใช้การลดหย่อนออม​ ลงทุน​ ใช้จ่ายหรือบริจาคเลยจะทำให้เราเสียเงินเพิ่มอีกจากที่เราต้องจ่ายภาษีในการจับจ่ายใช้สอยทั่วไปอยู่แล้ว​ ดังนั้นการลงทุนแบบออมเช่นกองทุน​ SSF RMF ก็สามารถนำมาลดหย่อนได้​เป็นต้น
  `,
  },
  {
    contentId: 6,
    altImg: "earn Money",
    pathImg: "img/contents/earnMoney.png",
    title: "จงใช้เวลาพุ่งเป้าไปที่การสร้างเงิน​ ไม่ใช่ใช้เวลาการออมเงิน",
    detail: `ต้องใช้เวลาอย่างน้อย95%ในการสร้างเงิน​ และใช้เวลาน้อยกว่า5%ในการออมเงิน
  หลายคนมีทัศนคติและการตั้งคำถามที่แตกต่างกันเรื่องการเงิน​ การที่เราจะหลุดการเป็นหนี้ได้นั้นต้องมีวินัยเรื่องการใช้จ่ายและเก็บออม​ บางคนคิดว่าจะแบ่งเก็บเงินอดออมได้อย่างไรในเมื่อทุกวันนี้เงินที่มีในแต่ละวันก็ไม่พอใช้อยู่แล้ว​ แต่ละเดือนก็ไม่พอใช้แค่เดือนชนเดือนยังยากเลยแล้วจะไปมีเงินเก็บได้อย่างไร​ บางทีคนทีคนที่คิดแบบนี้อาจจะเป็นปัญหาเรื่องการตั้งคำถามในแง่ลบเกินไป​ทำให้ลดทอนกำลังใจ
  แต่ถ้าเป็นเปลี่ยนคำถามใหม่ล่ะว่าปัจจุบันนี้เงินไม่พอใช้และไม่เหลือเก็บ​ แล้วจะทำยังไงให้มีเงินพอใช้และมีเงินเหลือเก็บ​ หากงานในปัจจุบันเงินน้อยไม่พอใช้​ เราสามารถทำงานดสริมอื่นงานที่2งานที่3ช่องทางอื่นๆ วิธีไหนที่สามารถมีรายได้เพิ่มได้หรือไม่ทำเราสามารถทำได้​ ลงทุนน้อยหรือไม่ลงทุนเลย​ สิ่งที่เราชอบหรือสนใจอยู่แล้ว​ ซึ่งมีหลายช่องทางหลายวิธีในปัจจุบันให้เลือกตามความชอบและถนัดของแต่ละคน​ น่าจะเป็นการตั้งคำถามที่เป็นแรงกระตุ้นให้เราคิด​ หาช่องทางและวิธีการต่างๆในการสร้างรายได้เพิ่ม​ หากเราเจอช่องทางในการสร้างรายได้เพิ่มขึ้นมากกว่า1ช่องทาง มีรายได้มากขึ้น ไม่เพิ่มรายจ่ายตาม เคลียหนี้สินที่มีอยู่​ สุดท้ายจึงค่อยแบ่งเงินเก็บออมได้มากตามไปด้วย`,
  },
];
//#endregion
const articleBanner = [[...articleStep1], [...articleStep2], [...articleStep3]];

//Todo: Add service get article
export default function ArticleCarouselView() {
  return (
    <>
      <Carousel
        navButtonsAlwaysVisible={false}
        navButtonsAlwaysInvisible={false}
        cycleNavigation={true}
        swipe={true}
        autoPlay={true}
        indicators={true}
        fullHeightHover={true}
        animation="slide"
        duration={500}
      >
        {articleBanner.map((item, i) => (
          <ArticleCardGroupView key={i} items={item} />
        ))}
      </Carousel>
    </>
  );
}
